app/views/users/_user.html.erb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
    <strong>Most recent post:</strong>
    <%= user.microposts.first&.content%>